# Pandas In Python

In [1]:
import pandas as pd
import numpy as np

# Series

In [2]:
data = np.array(['a','b','c','d'])
s = pd.Series(data)

In [3]:
s

0    a
1    b
2    c
3    d
dtype: object

In [4]:
r=pd.Series([1,2,3,4,8,np.nan,6,3])

In [5]:
r.values

array([ 1.,  2.,  3.,  4.,  8., nan,  6.,  3.])

In [6]:
pd.date_range('1/1/2011', periods=5)

DatetimeIndex(['2011-01-01', '2011-01-02', '2011-01-03', '2011-01-04',
               '2011-01-05'],
              dtype='datetime64[ns]', freq='D')

In [7]:
pd.DataFrame(np.random.randn(4, 3),columns=['A','B','C'],index=[4,5,6,7])

          A         B         C
4 -1.308632  0.235341 -0.252094
5 -0.876085  0.736789 -1.639897
6 -1.725744 -0.021784  1.408061
7 -0.816385 -0.178942 -2.037955

# DataFrame

In [8]:
d={"10":["one","I","First"],"20":["Two","II","Second"],
   "30":["Three","III","Third"]}

In [9]:
#pandas.DataFrame( data, index, columns, dtype, copy)
frame=pd.DataFrame(d) #shown in row column

In [10]:
frame

      10      20     30
0    one     Two  Three
1      I      II    III
2  First  Second  Third

In [11]:
frame.index=["A","B","C"] #chnage index

In [12]:
frame

      10      20     30
A    one     Two  Three
B      I      II    III
C  First  Second  Third

In [13]:
frame.to_csv("test2.csv",index=False) #remove index if false

In [14]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],index=["A","B","C"]) 
#add header to file

In [15]:
df

     Name  Age
A    Alex   10
B     Bob   12
C  Clarke   13

# write data in the excel file

In [16]:
d={"10":["one","I","First"],"20":["Two","II","Second"],"30":["Three","III","Third"]}
frame=pd.DataFrame(d)

In [17]:
frame

      10      20     30
0    one     Two  Three
1      I      II    III
2  First  Second  Third

In [18]:
frame.to_csv('test.csv') #it will add index in CSV file

In [19]:
frame.to_csv("test2.csv",index=False) #remove index

# Operation on rain.csv

In [20]:
rain=pd.read_csv('rain.csv')

In [21]:
rain.head(2) #from beginning, by default 5

  Outlook Temperature Humidity    Wind Play ball
0   sunny         hot     high    weak        no
1   sunny         hot     high  strong        no

In [22]:
rain.tail(2) #from End, by default 5

   Outlook Temperature Humidity    Wind Play ball
13    rain        mild     high  strong        no
14   sunny        mild     high  strong       yes

In [23]:
rain.shape

(15, 5)

In [24]:
rain.size

75

In [25]:
type(rain)

pandas.core.frame.DataFrame

In [26]:
rain['Outlook'].head(5)

0       sunny
1       sunny
2    overcast
3        rain
4        rain
Name: Outlook, dtype: object

In [27]:
rain[['Outlook','Wind']].head(5).values
#values convert object to array

array([['sunny', 'weak'],
       ['sunny', 'strong'],
       ['overcast', 'weak'],
       ['rain', 'weak'],
       ['rain', 'weak']], dtype=object)

In [28]:
rain.dtypes.head(5)

Outlook        object
Temperature    object
Humidity       object
Wind           object
Play ball      object
dtype: object

In [29]:
rain.index

RangeIndex(start=0, stop=15, step=1)

In [30]:
rain.index.values

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14],
      dtype=int64)

In [31]:
rain.columns.values

array(['Outlook', 'Temperature', 'Humidity', 'Wind', 'Play ball'],
      dtype=object)

# Change to Numpy Array

In [32]:
rain1=rain.to_numpy() #chnage to numpy array

In [33]:
rain1

array([['sunny', 'hot', 'high', 'weak', 'no'],
       ['sunny', 'hot', 'high', 'strong', 'no'],
       ['overcast', 'hot', 'high', 'weak', 'yes'],
       ['rain', 'mild', 'high', 'weak', 'yes'],
       ['rain', 'cool', 'normal', 'weak', 'yes'],
       ['rain', 'cool', 'normal', 'strong', 'no'],
       ['overcast', 'cool', 'normal', 'strong', 'yes'],
       ['sunny ', 'mild', 'high', 'weak', 'no'],
       ['sunny', 'cool', 'normal', 'weak', 'yes'],
       ['rain', 'mild', 'normal', 'weak', 'yes'],
       ['sunny', 'mild', 'normal', 'strong', 'yes'],
       ['overcast', 'mild', 'high', 'strong', 'yes'],
       ['overcast', 'hot', 'normal', 'weak', 'yes'],
       ['rain', 'mild', 'high', 'strong', 'no'],
       ['sunny', 'mild', 'high', 'strong', 'yes']], dtype=object)

# sort the DataFrame

In [34]:
rain.sort_index(axis=0,ascending=False).head(5) #sort on index axis=0 ROW

     Outlook Temperature Humidity    Wind Play ball
14     sunny        mild     high  strong       yes
13      rain        mild     high  strong        no
12  overcast         hot   normal    weak       yes
11  overcast        mild     high  strong       yes
10     sunny        mild   normal  strong       yes

In [35]:
'''ascending=True/False
inplce=True/False
kind=quicksort/mergesort/heapsort/default->quicksort'''
rain.sort_values(by=['Outlook'],ascending=False, inplace=False,kind='quicksort').head(10) #sort on index axis=0 ROW

   Outlook Temperature Humidity    Wind Play ball
7   sunny         mild     high    weak        no
0    sunny         hot     high    weak        no
1    sunny         hot     high  strong        no
8    sunny        cool   normal    weak       yes
10   sunny        mild   normal  strong       yes
14   sunny        mild     high  strong       yes
3     rain        mild     high    weak       yes
4     rain        cool   normal    weak       yes
5     rain        cool   normal  strong        no
9     rain        mild   normal    weak       yes

# Copy and View

In [36]:
rainview=rain #its a view.So,newdf2 is pointig to newdf
raincopy=rain.copy() #copy of same object

# drop a Column and Row

In [37]:
rain.drop('Wind',axis=1,inplace=False).head(2) #drop specific column

  Outlook Temperature Humidity Play ball
0   sunny         hot     high        no
1   sunny         hot     high        no

'''axis-> define row column need to drop
    inplace-> true then overwrite same object else create new object
    pass list to drop more than one'''

In [38]:
rain.drop(['Outlook',"Temperature"],axis=1).head(2)

  Humidity    Wind Play ball
0     high    weak        no
1     high  strong        no

In [39]:
rain.drop('Wind',axis=1).head(2)

  Outlook Temperature Humidity Play ball
0   sunny         hot     high        no
1   sunny         hot     high        no

In [40]:
rain.drop(0,axis=0).head(2)

    Outlook Temperature Humidity    Wind Play ball
1     sunny         hot     high  strong        no
2  overcast         hot     high    weak       yes

In [41]:
#reset the index by default True
rain.drop(0,axis=0).head(2).reset_index(drop=True)

    Outlook Temperature Humidity    Wind Play ball
0     sunny         hot     high  strong        no
1  overcast         hot     high    weak       yes

# Retrival of data from DataFrame

In [42]:
rain.iloc[0,3] #use index as number

'weak'

In [43]:
rain.loc[0,'Wind'] #use actual index

'weak'

In [44]:
rain.iloc[[0,4],[3,4]]

   Wind Play ball
0  weak        no
4  weak       yes

In [45]:
rain.loc[[0,4],['Wind',"Outlook"]]

   Wind Outlook
0  weak   sunny
4  weak    rain

In [46]:
rain.iloc[0,4]="yes" #return altered DataFrame

In [47]:
rain.loc[0,"Play ball"]="no"

# Converting data to array from dataframe

In [48]:
rain['Outlook'].head() #return an Object

0       sunny
1       sunny
2    overcast
3        rain
4        rain
Name: Outlook, dtype: object

In [49]:
rain['Outlook'].values #return an array

array(['sunny', 'sunny', 'overcast', 'rain', 'rain', 'rain', 'overcast',
       'sunny ', 'sunny', 'rain', 'sunny', 'overcast', 'overcast', 'rain',
       'sunny'], dtype=object)

In [50]:
np.array(list(zip(rain['Outlook'].values,rain['Temperature'].values)))

array([['sunny', 'hot'],
       ['sunny', 'hot'],
       ['overcast', 'hot'],
       ['rain', 'mild'],
       ['rain', 'cool'],
       ['rain', 'cool'],
       ['overcast', 'cool'],
       ['sunny ', 'mild'],
       ['sunny', 'cool'],
       ['rain', 'mild'],
       ['sunny', 'mild'],
       ['overcast', 'mild'],
       ['overcast', 'hot'],
       ['rain', 'mild'],
       ['sunny', 'mild']], dtype='<U8')

# SQL Command

In [51]:
#select 'play ball' from rain where play_ball="no"
rain[rain['Play ball']=='no' ].head(2)

  Outlook Temperature Humidity    Wind Play ball
0   sunny         hot     high    weak        no
1   sunny         hot     high  strong        no

In [52]:
#Select Outlook,Wind from rain
rain[['Wind',"Outlook"]].head(2)

     Wind Outlook
0    weak   sunny
1  strong   sunny

In [53]:
# select play ball,count(*) form rain group by play ball
rain.groupby('Play ball').size()

Play ball
no      5
yes    10
dtype: int64

# String Operation on python

In [54]:
s=pd.Series(['prem','prkash','alon','musk','linked','jobSerch'])

In [55]:
for x in s:
    print (x,end=",")

prem,prkash,alon,musk,linked,jobSerch,

In [56]:
'''s.str.startswith('p')
s.str.endswith('d')
s.str.find('e')
s.str.islower()
s.str.isupper()
s.str.isnumeric()
s.str.swapcase()
s.str.replace('p','$')
s.str.upper()
s.str.lower()'''

"s.str.startswith('p')\ns.str.endswith('d')\ns.str.find('e')\ns.str.islower()\ns.str.isupper()\ns.str.isnumeric()\ns.str.swapcase()\ns.str.replace('p','$')\ns.str.upper()\ns.str.lower()"

In [57]:
s.str.startswith('p')

0     True
1     True
2    False
3    False
4    False
5    False
dtype: bool

In [58]:
s.str.endswith('d')

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [59]:
s.str.find('e')

0    2
1   -1
2   -1
3   -1
4    4
5    4
dtype: int64

In [60]:
s.str.swapcase()

0        PREM
1      PRKASH
2        ALON
3        MUSK
4      LINKED
5    JOBsERCH
dtype: object

In [61]:
s.str.islower()

0     True
1     True
2     True
3     True
4     True
5    False
dtype: bool

In [62]:
s.str.isupper()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [63]:
s.str.isnumeric()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [64]:
s.str.replace('p','$')

0        $rem
1      $rkash
2        alon
3        musk
4      linked
5    jobSerch
dtype: object

In [65]:
s.str.cat(sep='_')

'prem_prkash_alon_musk_linked_jobSerch'

In [66]:
s.str.upper()

0        PREM
1      PRKASH
2        ALON
3        MUSK
4      LINKED
5    JOBSERCH
dtype: object

In [67]:
s.str.lower()

0        prem
1      prkash
2        alon
3        musk
4      linked
5    jobserch
dtype: object

# Mathematical Operations on DataFrame

In [68]:
heart=pd.read_csv('heart7.csv')

In [69]:
heart.head()

   age  Gender  Family  diet  Lifestyle  cholestrol  heartdisease
0    0       0       1     1          3           0             1
1    0       1       1     1          3           0             1
2    1       0       0     0          2           1             1
3    4       0       1     1          3           2             0
4    3       1       1     0          0           2             0

In [70]:
heart.describe()

,age,Gender,Family,diet,Lifestyle,cholestrol,heartdisease
count,19.000000,19.000000,19.000000,19.000000,19.000000,19.000000,19.000000
mean,2.157895,0.473684,0.736842,0.578947,1.473684,0.947368,0.578947
std,1.537066,0.512989,0.452414,0.507257,1.306753,0.911268,0.507257
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,1.000000,0.000000,0.500000,0.000000,0.000000,0.000000,0.000000
50%,2.000000,0.000000,1.000000,1.000000,2.000000,1.000000,1.000000
75%,3.500000,1.000000,1.000000,1.000000,3.000000,2.000000,1.000000
max,4.000000,1.000000,1.000000,1.000000,3.000000,2.000000,1.000000

In [71]:
heart['age'].sum()

41

In [72]:
heart['age'].mean()

2.1578947368421053

In [73]:
heart['age'].median()

2.0

In [74]:
heart['age'].mode()

0    4
dtype: int64

In [75]:
heart['age'].count()

19

In [76]:
heart['age'].std()

1.5370663939515443

In [77]:
heart['age'].min()

0

In [78]:
heart['age'].max()

4

In [79]:
heart['age'].prod()

0

In [80]:
heart['age'].cumsum().head()

0    0
1    0
2    1
3    5
4    8
Name: age, dtype: int64

In [81]:
heart['age'].cumprod().head()

0    0
1    0
2    0
3    0
4    0
Name: age, dtype: int64

# Stack and Pivot Table

In [82]:
df = pd.DataFrame([[0, 1], [2, 3]],index=['cat', 'dog'],columns=['weight', 'height'])

In [83]:
df

     weight  height
cat       0       1
dog       2       3

In [84]:
df.stack()

cat  weight    0
     height    1
dog  weight    2
     height    3
dtype: int64

# slicing

In [85]:
rain.head(2)

  Outlook Temperature Humidity    Wind Play ball
0   sunny         hot     high    weak        no
1   sunny         hot     high  strong        no

In [86]:
rain[2:5]

    Outlook Temperature Humidity  Wind Play ball
2  overcast         hot     high  weak       yes
3      rain        mild     high  weak       yes
4      rain        cool   normal  weak       yes

# Alteration

In [87]:
rain['Wind'].replace({'weak': 0,'strong': 1},inplace=True)

In [88]:
rain.head(2)

  Outlook Temperature Humidity  Wind Play ball
0   sunny         hot     high     0        no
1   sunny         hot     high     1        no

In [89]:
rain.iloc[0,1]="HOT"

In [90]:
rain.head(2)

  Outlook Temperature Humidity  Wind Play ball
0   sunny         HOT     high     0        no
1   sunny         hot     high     1        no

In [91]:
rain.groupby('Play ball').size()

Play ball
no      5
yes    10
dtype: int64

In [92]:
rain.loc[1,'Play ball']="yes"

In [93]:
rain.head(2)

  Outlook Temperature Humidity  Wind Play ball
0   sunny         HOT     high     0        no
1   sunny         hot     high     1       yes

In [99]:
rain.groupby('Temperature').size()

Temperature
HOT     1
cool    4
hot     3
mild    7
dtype: int64

In [95]:
rain['Wind'].sum()

7

In [102]:
rain[rain['Temperature']=='hot'& rain['Temperature']=='Hot']

TypeError: cannot compare a dtyped [object] array with a scalar of type [bool]